jekyll/_posts/2017-02-13-why-to-blog.html
---
layout: post
title: Why to blog
categories: attempts
---
<div id="outline-container-orga6d11c1" class="outline-2">
<h2 id="orga6d11c1">Why to blog</h2>
<div class="outline-text-2" id="text-orga6d11c1">
</div><div id="outline-container-org4cafa0f" class="outline-3">
<h3 id="org4cafa0f">Sexual Release</h3>
<div class="outline-text-3" id="text-org4cafa0f">
<p>
Blogging feels great! It's normal and healthy. Average men blog
anywhere between once a week and twice a day. Whatever feels
right! As long as you're still making time for your family and
friends, and not neglecting your responsibilities, it's fine to
keep blogging.
</p>

<p>
If you're new to blogging like I am, talking about blogging with
your family and friends can be scary. Start small. Maybe make some
jokes. Think about your own comfort first, and go slow. Light some
candles! This is you time.
</p>

<p>
It's all about the release, babey!
</p>
</div>
</div>

<div id="outline-container-org4c7062d" class="outline-3">
<h3 id="org4c7062d">That sweet bloggo cash</h3>
<div class="outline-text-3" id="text-org4c7062d">
<p>
The internet is a platform for delivering ads. If you want people
to see ads, you should consider bloggong. Lots of people read
blogs, all over the world. I wanted a slice of that sweet bloggo
cash, so I started this blog. Now, I might make some money.
</p>

<p>
Ads should be tasteful and relevant to your audience. Personally I
don't like a lot of bloinking lights or scantily clad people (sex
sells but not to me).
</p>
</div>
</div>

<div id="outline-container-org69c5eb4" class="outline-3">
<h3 id="org69c5eb4">Internet fame</h3>
<div class="outline-text-3" id="text-org69c5eb4">
<p>
Almost all famous people blog. This much is fact. Many famous
people even started blogging before they got famous. Lots of
people keep travel blogs or post photos of their food these
days. Sometimes obscenely large numbers of people look at your
pictures of food and then you are, what they call, internet
famous. Okay so humor isn't my strong suite.
</p>

<p>
You may have a few hundred readers or you may have a few readers
but either way, your blog is a tangible way to get yourself out
there for your friends to read. If you're inclined to blog you're
probably not posting a lot on facbook or twitter, so this may be
the only way.
</p>
</div>
</div>

<div id="outline-container-org92074f1" class="outline-3">
<h3 id="org92074f1">Makes a good resume bulletpoint</h3>
<div class="outline-text-3" id="text-org92074f1">
<p>
If your blog is in a public place recruiters will probably see all
your posts, so you should feel free to include it in your
resume. It signals initiative and also, even if it's bad it's not
embarrassing. Words on a web page are just words. An experimental
playground for ideas. There are no bad questions, only bad
answers.
</p>
</div>
</div>

<div id="outline-container-org3cf9a02" class="outline-3">
<h3 id="org3cf9a02">Impress your friends</h3>
<div class="outline-text-3" id="text-org3cf9a02">
<p>
Blogging is a status symbol. Blog, smoke, sex, repeat.
</p>
</div>
</div>

<div id="outline-container-org13ce3fc" class="outline-3">
<h3 id="org13ce3fc">Be smart</h3>
<div class="outline-text-3" id="text-org13ce3fc">
<p>
One good trend I've been seeing lately is that some smart people
keep blogs. If smart people make blogs then more regular people
can read the contents of those blogs. I personally read many hours
of blog daily, and can say that my thinking and reading skills
have vastly improved. Also I definitely don't believe in the dark
enlightenment now. I told my girlfriend I wanted to blog about
ontologies because the word ontology was something I learned in my
philosophy class in college.
</p>

<p>
Don't believe everything you read online, but I'd say that blogs
are of above average reliability. I plan to only publish reliable
things, so you can trust me.
</p>

<p>
All I know is, even if you can't be smart, you can at least relate
to that #1 <a href="#org4cafa0f">tip</a>.
</p>
</div>
</div>
</div>
